inp = open('input.txt', )
out = open('out2.txt', 'wt')
trans = dict(zip(['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','щ','ш','ь','ы','ъ','э','ю','я','А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Щ','Ш','Ь','Ы','Ъ','Э','Ю','Я'],['a','b','v','g','d','e','io','j','z','i','i','k','l','m','n','o','p','r','s','t','u','f','h','ts','ch','sh\'','sh','\'','i','','e','iu','ia','A','B','V','G','D','E','Io','J','Z','I','I','K','L','M','N','O','P','R','S','T','U','F','H','Ts','Ch','Sh\'','Sh','\'','I','','E','Iu','Ia']))
bukv = ['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','щ','ш','ь','ы','ъ','э','ю','я','А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Щ','Ш','Ь','Ы','Ъ','Э','Ю','Я']
print(trans)
for i in range(6000):
    s = inp.readline()
    if len(s) > 10 and s.count('[') == 0 and s.count('…')==0 and s.count('X')==0 and s.count('L')==0 and s.count('V')==0 and s.count('C')==0:
        k = ''
        for symbs in s:            
            if bukv.count(symbs) !=0:
                k+=trans[symbs]
            else:
                k+=symbs
        out.write(k[2:-1] + '\n')